# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

cask_args appdir: '~/Applications'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh' #github
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup' # backup App settings
brew 'mas' # Mac App Store manager
brew 'stripe/stripe-cli/stripe'
brew 'tree' # List directories in a tree structure

# Development
brew 'imagemagick'
brew 'heroku/brew/heroku'
brew 'nvm'
brew 'postgres'
brew 'pgcli'
brew 'redis'
brew 'rvm'
brew 'sqlite3'
brew 'watchman'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'android-studio'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'harvest'
cask 'imageoptim'
cask 'iterm2'
cask 'postman'
cask 'quip'
cask 'slack'
cask 'spectacle'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Spark', id: 1176895641
